<template>
  <H1 top>
    Vexip UI
  </H1>
  <P>
    Vexip UI 提供了一系类开箱即用的组件。 每个组件几乎所有的
    <Strong> 属性默认值 </Strong>
    均可以通过注入配置快速修改（除了值和选项属性），轻松实现定制化。
    同时，组件代码的编写非常注重降低
    <Strong> 源码阅读 </Strong>
    的门槛，代码的排布尽可能的贴近平时的业务代码的习惯，避免让人眼花缭乱的封装。
  </P>
  <H2> 特性 </H2>
  <UL>
    <li>还算多的组件，为网站开发助力，希望能提高点效率</li>
    <li>开箱即用的高质量 Vue3 组件</li>
    <li>遵循直觉的设计，代码也尽可能写得直接一些，不要拐弯抹角</li>
    <li>使用组合式 Api 编写，性能与拓展性应该还不错</li>
    <li>700+ 单元测试，为组件的使用提供良好的基础稳定性</li>
  </UL>
  <Blockquote> 所有组件兼容现代浏览器，尽量保证近两三个版本的支持。 </Blockquote>
</template>
